{
  "unit": 4,
  "j_code": "CA",
  "course_code": "DE-ONLINE",
  "lang": "en",
  "title": "Sharing the Road & Special Situations",
  "minutes_required": 15,
  "objectives": [
    "Learn core CA traffic safety concepts"
  ],
  "sections": [
    {
      "title": "Pedestrians & Crosswalks",
      "lessons": [
        {
          "title": "Crosswalks & Right-of-Way",
          "minutes": 3,
          "content": [
            "Pedestrians have the right-of-way at marked and unmarked crosswalks. An unmarked crosswalk is the area across an intersection where sidewalks would meet. Always scan both sides for people stepping off the curb.",
            "When turning, yield to people in the crosswalk you will cross. Do not pass a vehicle stopped at a crosswalk because a person you cannot see may be crossing.",
            "Stop before the crosswalk and wait until it is fully clear. Keep crosswalks and sidewalks open for people using wheelchairs, strollers, or walkers."
          ],
          "review": []
        },
        {
          "title": "Blind Pedestrians & School Zones",
          "minutes": 2,
          "content": [
            "Blind pedestrians using a white cane or guide dog have the absolute right-of-way. Stop well before the crosswalk so they can hear your engine and judge your position.",
            "Do not honk, rev the engine, or wave them to cross. Wait until they have safely finished crossing.",
            "Near schools, slow down, follow crossing guard directions, and watch for kids who may move unpredictably."
          ],
          "review": []
        }
      ]
    },
    {
      "title": "Bicyclists & Bike Lanes",
      "lessons": [
        {
          "title": "Passing Bicyclists & the 3‑Foot Rule",
          "minutes": 3,
          "content": [
            "Give bicyclists at least 3 feet when passing. If you cannot give 3 feet, slow down and wait until it is safe to pass.",
            "Increase space at higher speeds or with wind blasts from large vehicles. Treat bicyclists as you would a slow-moving car.",
            "Check mirrors and blind spots before returning to your lane to avoid cutting off the bicyclist."
          ],
          "review": []
        },
        {
          "title": "Bike Lanes & Right Turns",
          "minutes": 3,
          "content": [
            "Bike lanes are for bicyclists. You may enter a bike lane only to park (where allowed), to enter or leave the roadway, or to make a right turn.",
            "Merge into the bike lane no more than about 200 feet before your right turn. Yield to any bicyclist in the bike lane before crossing it.",
            "Signal early, check over your right shoulder, and look for fast-moving bikes before turning."
          ],
          "review": []
        },
        {
          "title": "Dooring & Shared Lanes",
          "minutes": 2,
          "content": [
            "Before opening your door, check mirrors and look over your shoulder for bicyclists. Opening a door into moving traffic is dangerous and illegal if it interferes with others.",
            "Bicyclists may use the full lane when it is too narrow to share safely or to avoid hazards. Do not squeeze or crowd them.",
            "Slow down and give space when bicyclists must ride around parked cars, potholes, or debris."
          ],
          "review": []
        }
      ]
    },
    {
      "title": "Motorcycles & Scooters",
      "lessons": [
        {
          "title": "See and Be Seen",
          "minutes": 3,
          "content": [
            "Motorcycles are smaller and can be hard to judge for speed and distance. Look twice at left turns and before changing lanes.",
            "Most motorcycle crashes with cars happen when a driver turns left in front of a motorcycle. Yield until you are certain the way is clear.",
            "Use mirrors and check blind spots. Signal early so riders know your plan."
          ],
          "review": []
        },
        {
          "title": "Lane Sharing Awareness & Following Distance",
          "minutes": 2,
          "content": [
            "Motorcyclists may legally lane split in California. Do not block or discourage a rider who is lane splitting.",
            "Allow more space behind motorcycles. Keep at least a 4‑second following distance and increase space in poor weather.",
            "Check mirrors before lane changes and avoid sudden moves that could surprise a rider."
          ],
          "review": []
        }
      ]
    },
    {
      "title": "School Buses & Emergency Vehicles",
      "lessons": [
        {
          "title": "School Bus Lights & Stops",
          "minutes": 3,
          "content": [
            "Flashing yellow lights on a school bus mean it is preparing to stop. Slow down and prepare to stop.",
            "Flashing red lights and a stop arm mean you must stop from either direction until the lights stop flashing and children are safe. Remain stopped even if you are in a hurry.",
            "If the bus is on the other side of a divided highway or a multilane road with a physical median, you do not have to stop. Still use caution for children near the roadway."
          ],
          "review": []
        },
        {
          "title": "Yielding to Emergency Vehicles",
          "minutes": 3,
          "content": [
            "When you see red lights and hear a siren, pull to the right edge of the road and stop. Do not stop in an intersection.",
            "If you are in an intersection when the vehicle approaches, finish crossing, then pull to the right and stop. Keep crosswalks clear.",
            "Do not follow within a close distance behind an emergency vehicle using lights and siren."
          ],
          "review": []
        },
        {
          "title": "Move Over Law & Intersections",
          "minutes": 2,
          "content": [
            "When approaching a stopped emergency, law enforcement, tow, or Caltrans vehicle with flashing lights, move to a non‑adjacent lane when safe or slow down. This is the Move Over/Slow Down requirement.",
            "Watch for workers on the shoulder and be ready for sudden stops. Keep intersections and crosswalks clear for emergency movements.",
            "On multilane roads, signal early and change lanes smoothly. If you cannot change lanes, slow to a safe speed."
          ],
          "review": []
        }
      ]
    },
    {
      "title": "Large Trucks & Work Zones",
      "lessons": [
        {
          "title": "No‑Zones & Wide Turns",
          "minutes": 3,
          "content": [
            "Large trucks and buses have big blind spots called No‑Zones on all four sides. If you cannot see the driver’s mirrors, they cannot see you.",
            "Give extra room because trucks need more space to turn and stop. Expect wide right turns that begin from the left lane.",
            "Never squeeze between a turning truck and the curb. Stay back and let the truck complete the turn."
          ],
          "review": []
        },
        {
          "title": "Passing & Merging Around Trucks",
          "minutes": 3,
          "content": [
            "Pass trucks quickly on the left and do not linger beside them. Make sure you can see the entire front of the truck in your mirror before moving back in.",
            "Do not cut in front of a truck or merge at a slow speed. Trucks take longer to stop due to size and weight.",
            "Give trucks room on downgrades and in rain or wind. Leave more following distance behind them."
          ],
          "review": []
        },
        {
          "title": "Work Zones & Flaggers",
          "minutes": 3,
          "content": [
            "Orange signs, cones, and arrow boards mean a work zone. Slow down and be ready for lane shifts and sudden stops.",
            "Obey flaggers; their directions have the same authority as signs and signals. Fines and penalties can increase for violations in work zones.",
            "Merge early and leave extra space around workers and equipment. Avoid distractions."
          ],
          "review": []
        }
      ]
    },
    {
      "title": "Railroad Crossings & Animals",
      "lessons": [
        {
          "title": "Active vs. Passive Crossings",
          "minutes": 3,
          "content": [
            "Active crossings have gates, bells, or flashing red lights. Obey all signals and never drive around lowered gates.",
            "Passive crossings may have only a crossbuck or sign. Slow, look both ways, listen, and be sure there is room on the far side before crossing.",
            "Never stop on the tracks. If traffic backs up, wait before the tracks until you can fully clear."
          ],
          "review": []
        },
        {
          "title": "If You Are Stuck on the Tracks",
          "minutes": 2,
          "content": [
            "If your vehicle stalls or gets stuck on the tracks, get everyone out immediately. If a train is coming, run toward the train at an angle away from the tracks.",
            "Use the blue Emergency Notification System (ENS) sign at the crossing to call for help. Give the operator the crossing ID number.",
            "Call 9‑1‑1 and the railroad number on the sign. Only try to push the vehicle if there is no train in sight and it is safe."
          ],
          "review": []
        },
        {
          "title": "Animals & Slow‑Moving/Farm Vehicles",
          "minutes": 3,
          "content": [
            "Watch for animal crossings and horseback riders. Slow down and follow a rider’s hand signals or the instructions of animal handlers.",
            "Do not honk near horses or livestock. Give them extra space and be prepared to stop if they appear spooked.",
            "Slow‑moving vehicles display an orange triangle and usually travel 25 mph or less. Pass only when legal and safe, and leave plenty of room."
          ],
          "review": []
        }
      ]
    }
  ],
  "metadata": {
    "version": "1.0.0",
    "updated_at": "2025-08-20T06:02:45.964Z"
  }
}
