{
  "unit": 8,
  "j_code": "CA",
  "course_code": "DE-ONLINE",
  "lang": "en",
  "title": "CA DE-ONLINE – Unit 8: Collisions, Financial Responsibility & Ownership Basics",
  "minutes_required": 75,
  "objectives": ["Learn core CA traffic safety concepts"],
  "sections": [
    {
      "title": "First Minutes After a Collision",
      "lessons": [
        {
          "title": "Stop, Secure, and Check for Injuries",
          "minutes": 5,
          "content": [
            "Collisions are stressful. Your first job is to protect people and prevent a second crash. Stay calm and take methodical steps.",
            "[object Object]",
            "Put out cones/triangles if available. Do not stand in traffic lanes. Keep children and pets out of the roadway.",
            "If an animal is injured or killed, contact the nearest humane society or law enforcement. Do not try to move an injured animal.  [oai_citation:3‡DriverHandbook_CA_EN.pdf](file-service://file-JZ5buQ9fdTyc75quRFSXq5)"
          ],
          "review": []
        },
        {
          "title": "Prevent Secondary Crashes and Call for Help",
          "minutes": 5,
          "content": [
            "[object Object]",
            "If traffic is already blocked and responders are on their way, avoid standing between vehicles. Keep seat belts on if stopped on a high-speed shoulder."
          ],
          "review": []
        }
      ]
    },
    {
      "title": "Exchange Information & Reporting",
      "lessons": [
        {
          "title": "Exchange the Right Information",
          "minutes": 5,
          "content": [
            "After everyone is safe, exchange information calmly. Take photos before moving vehicles if it’s safe.",
            "[object Object]",
            "Be factual. Do not argue about fault or make promises. Let insurers and, if needed, law enforcement sort out responsibility."
          ],
          "review": []
        },
        {
          "title": "When and How to Report",
          "minutes": 5,
          "content": [
            "Report promptly according to current handbook rules. If anyone is injured or killed, you must report to law enforcement within the timeframe described in the current handbook. Your insurance agent, broker, or legal representative may also file that report.  [oai_citation:5‡DriverHandbook_CA_EN.pdf](file-service://file-JZ5buQ9fdTyc75quRFSXq5)",
            "You must also report certain collisions to DMV using the Report of Traffic Accident Occurring in California (SR 1) form within the timeframe and thresholds stated in the current handbook (for example, injury/death or property damage above the DMV threshold). Law enforcement will not file the SR 1 for you.  [oai_citation:6‡DriverHandbook_CA_EN.pdf](file-service://file-JZ5buQ9fdTyc75quRFSXq5)",
            "[object Object]"
          ],
          "review": []
        }
      ]
    },
    {
      "title": "Insurance & Financial Responsibility",
      "lessons": [
        {
          "title": "Proof of Insurance and Who Is Responsible",
          "minutes": 5,
          "content": [
            "California requires proof of financial responsibility (insurance) when you drive and during a drive test. You must show proof after a collision.  [oai_citation:8‡DriverHandbook_CA_EN.pdf](file-service://file-JZ5buQ9fdTyc75quRFSXq5)",
            "[object Object]",
            "State law sets minimum liability coverage amounts. Use at least the current minimums listed in the DMV handbook and your policy documents.  [oai_citation:11‡DriverHandbook_CA_EN.pdf](file-service://file-JZ5buQ9fdTyc75quRFSXq5)"
          ],
          "review": []
        },
        {
          "title": "If You Lack Proof — Consequences & Options",
          "minutes": 5,
          "content": [
            "If you are in a collision without proper insurance, your driving privilege may be suspended, regardless of fault, under current rules.  [oai_citation:12‡DriverHandbook_CA_EN.pdf](file-service://file-JZ5buQ9fdTyc75quRFSXq5)",
            "To reinstate during the eligible period, you may need to file and maintain a California Insurance Proof Certificate (SR 22/SR 1P).  [oai_citation:13‡DriverHandbook_CA_EN.pdf](file-service://file-JZ5buQ9fdTyc75quRFSXq5)",
            "If cost is a barrier, see the California Low Cost Automobile Insurance Program for eligibility.  [oai_citation:14‡DriverHandbook_CA_EN.pdf](file-service://file-JZ5buQ9fdTyc75quRFSXq5)"
          ],
          "review": []
        }
      ]
    },
    {
      "title": "Special Situations",
      "lessons": [
        {
          "title": "Parked Property & Animals",
          "minutes": 5,
          "content": [
            "[object Object]",
            "Document the scene with photos and time/location notes. This protects you and helps owners and insurers resolve claims fairly."
          ],
          "review": []
        },
        {
          "title": "Hit-and-Run: What It Is and Why You Must Never Do It",
          "minutes": 5,
          "content": [
            "Failing to stop after a collision is hit-and-run. Penalties are severe. Always stop, secure the scene, and exchange information or report as required.  [oai_citation:17‡DriverHandbook_CA_EN.pdf](file-service://file-JZ5buQ9fdTyc75quRFSXq5)",
            "[object Object]"
          ],
          "review": []
        }
      ]
    },
    {
      "title": "Vehicle Ownership Basics",
      "lessons": [
        {
          "title": "Title Transfers, Buying & Selling",
          "minutes": 5,
          "content": [
            "When you buy or sell a vehicle in California, you must transfer ownership and notify DMV within the time frames in the current handbook. Sellers must submit a Notice of Transfer and Release of Liability (NRL).  [oai_citation:18‡DriverHandbook_CA_EN.pdf](file-service://file-JZ5buQ9fdTyc75quRFSXq5)",
            "[object Object]"
          ],
          "review": []
        },
        {
          "title": "Registration & Smog Basics",
          "minutes": 5,
          "content": [
            "Vehicles used in California must be registered in California. Follow the current DMV steps and deadlines when you become a resident or start working here.  [oai_citation:19‡DriverHandbook_CA_EN.pdf](file-service://file-JZ5buQ9fdTyc75quRFSXq5)",
            "All vehicles registered in California must meet California requirements, including vehicle emission controls. The DMV cannot register a vehicle that does not qualify.  [oai_citation:20‡DriverHandbook_CA_EN.pdf](file-service://file-JZ5buQ9fdTyc75quRFSXq5)",
            "[object Object]"
          ],
          "review": []
        }
      ]
    },
    {
      "title": "After the Tow: Repairs & Avoiding Scams",
      "lessons": [
        {
          "title": "Towing, Estimates, and Your Choices",
          "minutes": 5,
          "content": [
            "You choose where your vehicle goes. If safe, request a tow to your home or a repair shop you prefer. Get the towing company’s name, address, and rates.",
            "[object Object]",
            "Your insurer can recommend shops, but you are generally free to choose a qualified repair facility."
          ],
          "review": []
        },
        {
          "title": "Spotting Red Flags",
          "minutes": 5,
          "content": [
            "[object Object]",
            "Keep control of your documents. Photograph all damage and parts replaced. Save all invoices and communications."
          ],
          "review": []
        }
      ]
    },
    {
      "title": "Records, Claims & Teen/Guardian Responsibilities",
      "lessons": [
        {
          "title": "Build Your Collision File",
          "minutes": 5,
          "content": [
            "[object Object]",
            "Dashcam clips, intersection camera timestamps, and annotated maps can speed claims resolution. Back up files to cloud storage."
          ],
          "review": []
        },
        {
          "title": "Talk to Your Insurer and, If You’re a Minor, to Your Parent/Guardian",
          "minutes": 5,
          "content": [
            "Report the collision to your insurer promptly. Share facts, photos, and any report numbers. Ask how to handle repairs, rentals, and medical bills.",
            "For minors with a provisional license, collisions and traffic violations can lead to license restrictions, probation, or suspension under current rules. Keep parents/guardians informed; they assume financial responsibility for drivers under 18. ",
            "[object Object]"
          ],
          "review": []
        }
      ]
    }
  ],
  "metadata": {
    "version": "1.0.0",
    "updated_at": "2025-08-20T06:02:45.968Z"
  }
}
