{
    "unitNumber": 6,
    "title": "Estrategias para Conducir en Autopistas y Zonas Urbanas",
    "minutesRequired": 85,
    "objectives": [
      "Incorporarse con suavidad usando el carril de aceleración sin detenerse a menos que sea necesario.",
      "Elegir el carril correcto en la autopista y usar el carril izquierdo principalmente para rebasar.",
      "Identificar y seguir las reglas y demarcaciones de carriles HOV (viaje compartido) y carriles exprés.",
      "Controlar la velocidad según la ley básica de velocidad de California y las condiciones del camino.",
      "Mantener una distancia de seguimiento segura a velocidades de autopista y aumentarla en condiciones adversas.",
      "Planear salidas con anticipación, leer señalamientos de los entronques y circular con cuidado en zonas de entrelazado.",
      "Buscar peligros urbanos como intersecciones, paradas frecuentes y peatones.",
      "Compartir la vía con usuarios vulnerables: bicicletas, patinetas/motonetas, autobuses y tren ligero.",
      "Aplicar reglas de estacionamiento en ciudades: colores de guarnición, parquímetros, límites de tiempo y estacionamiento en cuestas.",
      "Manejar condiciones especiales: resplandor nocturno, rocío de lluvia en autopista, hidroplaneo, viento y turbulencia de vehículos grandes."
    ],
    "sections": [
      {
        "id": "U06-S01",
        "title": "Fundamentos de Autopista: Rampas e Incorporación",
        "lessons": [
          {
            "id": "U06-L01",
            "title": "Carriles de aceleración y semáforos de rampa",
            "minutes": 5,
            "content": [
              { "type": "paragraph", "text": "Las rampas y carriles de aceleración le permiten alcanzar la velocidad de la autopista antes de incorporarse. Mire lejos y ajuste su velocidad al flujo del tráfico." },
              { "type": "paragraph", "text": "Use todo el carril de aceleración. No se detenga en la rampa a menos que el tráfico o una señal lo requiera. El tráfico de la autopista tiene la preferencia de paso." },
              { "type": "paragraph", "text": "Los semáforos de rampa controlan el acceso. Obedezca el letrero—usualmente pasa un vehículo por luz verde por carril. Siga los letreros y reglas locales." },
              { "type": "bulleted-list", "items": ["Encienda la direccional y revise espejos y puntos ciegos.", "Elija un espacio que no obligue a otros a frenar bruscamente.", "Cambie un carril a la vez—no cruce líneas continuas.", "Después de incorporarse, deje por lo menos 3 segundos de distancia."] }
            ]
          },
          {
            "id": "U06-L02",
            "title": "Etiqueta al incorporarse y elección del espacio",
            "minutes": 5,
            "content": [
              { "type": "paragraph", "text": "Use SMOG: Señalice, revise Espejos, verifique Sobre el hombro y Continúe cuando esté despejado. Entre a velocidad similar a la del tráfico." },
              { "type": "paragraph", "text": "Si alguien acelera para bloquearlo, siga señalizando y ajuste para entrar en el siguiente espacio. No se detenga en la rampa a menos que sea requerido." },
              { "type": "paragraph", "text": "Cuando dos flujos se combinan, sea cortesía y alternen si es necesario. Mantenga su carril y comuníquese con las luces direccionales." },
              { "type": "bulleted-list", "items": ["Errores comunes: detenerse en la rampa, mirar solo por espejos, entrar demasiado despacio, cruzar varios carriles de una vez."] }
            ]
          },
          {
            "id": "U06-L03",
            "title": "Salidas: rampas, señales y uso del acotamiento",
            "minutes": 4,
            "content": [
              { "type": "paragraph", "text": "Identifique su salida con anticipación. Cambie al carril correcto de uno en uno y señalice por al menos cinco segundos (≈400 pies) antes de salir." },
              { "type": "paragraph", "text": "Obedezca las señales y velocidades sugeridas de la rampa. No cruce líneas continuas ni el área ‘gore’ para tomar una salida a último momento." },
              { "type": "paragraph", "text": "Si se pasa, continúe a la siguiente salida. Nunca retroceda en la autopista." },
              { "type": "bulleted-list", "items": ["Avería: oríllese al acotamiento derecho, encienda intermitentes de emergencia y permanezca en el vehículo hasta que llegue ayuda.", "Use asistencia vial/FSP cuando esté disponible."] }
            ]
          }
        ]
      },
      {
        "id": "U06-S02",
        "title": "Uso de carriles, rebase y HOV",
        "lessons": [
          {
            "id": "U06-L04",
            "title": "Numeración de carriles y derecha vs. izquierda",
            "minutes": 5,
            "content": [
              { "type": "paragraph", "text": "En vías de varios carriles, el carril de la izquierda es el número 1; hacia la derecha los números aumentan." },
              { "type": "paragraph", "text": "Use el carril izquierdo principalmente para rebasar o dar vuelta a la izquierda. Use los carriles derechos para entrar/salir y para tráfico más lento." },
              { "type": "paragraph", "text": "Líneas blancas continuas indican que no debe cambiar de carril; líneas blancas discontinuas permiten cambiar cuando sea seguro." },
              { "type": "bulleted-list", "items": ["Señalice, revise espejos y mire sobre el hombro.", "Cambie un carril por vez; evite zigzaguear.", "No reduzca la velocidad innecesariamente antes de cambiar."] }
            ]
          },
          {
            "id": "U06-L05",
            "title": "Rebase y hábitos de ‘conserve su derecha’",
            "minutes": 4,
            "content": [
              { "type": "paragraph", "text": "Rebase por la izquierda y regrese solo cuando vea los faros del vehículo rebasado en su espejo retrovisor." },
              { "type": "paragraph", "text": "Rebasar por la derecha se permite solo en situaciones específicas. Nunca salga del pavimento para rebasar." },
              { "type": "paragraph", "text": "No permanezca innecesariamente en el carril izquierdo. Si viene tráfico más rápido por detrás, cámbiese a la derecha cuando sea seguro." },
              { "type": "bulleted-list", "items": ["Si lo rebasan, mantenga velocidad y carril.", "No acelere para impedir que otro rebase."] }
            ]
          },
          {
            "id": "U06-L06",
            "title": "Carriles de viaje compartido (HOV) y exprés",
            "minutes": 5,
            "content": [
              { "type": "paragraph", "text": "Los carriles HOV se marcan con un rombo y señalamientos. Son para vehículos con ocupación mínima publicada, vehículos de bajas emisiones con calcomanía del DMV y motocicletas (salvo se indique lo contrario)." },
              { "type": "paragraph", "text": "Nunca cruce líneas blancas dobles y continuas para entrar o salir de un HOV. Use las zonas designadas con líneas discontinuas." },
              { "type": "paragraph", "text": "Algunas rutas usan carriles exprés con cobro o transpondedor. Siga los letreros y reglas locales." },
              { "type": "bulleted-list", "items": ["Revise horarios y ocupación mínima publicada.", "Fíjese en rampas HOV a la izquierda y separadores especiales.", "Evite maniobras de último momento a través de la franja de separación."] }
            ]
          }
        ]
      },
      {
        "id": "U06-S03",
        "title": "Velocidad, distancia y espacio",
        "lessons": [
          {
            "id": "U06-L07",
            "title": "Ley básica de velocidad de California",
            "minutes": 5,
            "content": [
              { "type": "paragraph", "text": "Nunca maneje más rápido de lo que sea seguro para las condiciones, sin importar el límite publicado." },
              { "type": "paragraph", "text": "El máximo típico en autopistas es 65 mph salvo que se indique lo contrario. Reduzca por tráfico, clima, visibilidad y superficie." },
              { "type": "paragraph", "text": "No obstruya el flujo circulando muy por debajo del tráfico; cámbiese a la derecha cuando sea seguro." },
              { "type": "bulleted-list", "items": ["Esté atento a límites especiales cerca de escuelas, callejones e intersecciones sin visibilidad.", "Siga siempre los letreros y reglas locales."] }
            ]
          },
          {
            "id": "U06-L08",
            "title": "Distancia de seguimiento en autopista",
            "minutes": 4,
            "content": [
              { "type": "paragraph", "text": "Use la regla de tres segundos como mínimo. Aumente la distancia a mayor velocidad y con lluvia, oscuridad o rocío." },
              { "type": "paragraph", "text": "Si alguien lo sigue de cerca, mantenga su curso y luego cámbiese a la derecha cuando sea seguro para dejarlo pasar." },
              { "type": "paragraph", "text": "Evite meterse en espacios pequeños. Tras incorporarse, reconstruya su colchón de espacio." },
              { "type": "bulleted-list", "items": ["Elija un punto fijo adelante.", "Cuando el vehículo de enfrente lo pase, cuente ‘mil‑uno, mil‑dos, mil‑tres’.", "Si llega antes de terminar, va demasiado cerca."] }
            ]
          },
          {
            "id": "U06-L09",
            "title": "Campo visual, rutas de escape y colchón de espacio",
            "minutes": 4,
            "content": [
              { "type": "paragraph", "text": "Escanee por lo menos 10 segundos adelante para detectar con tiempo frenadas, basura y cierres de carril." },
              { "type": "paragraph", "text": "Evite circular en puntos ciegos de otros. Genere espacio a ambos lados cuando se pueda." },
              { "type": "paragraph", "text": "Si no puede ver alrededor de un vehículo grande, aumente distancia o cambie de carril cuando sea seguro." },
              { "type": "bulleted-list", "items": ["Si hay peligros a ambos lados, atienda uno a la vez: reduzca por tráfico de frente y luego rebase a ciclistas dejando más espacio.", "Tenga una ‘vía de escape’ si el carril se cierra."] }
            ]
          }
        ]
      },
      {
        "id": "U06-S04",
        "title": "Entronques y estrategia de salida",
        "lessons": [
          {
            "id": "U06-L10",
            "title": "Tipos de entronques y señalamientos",
            "minutes": 5,
            "content": [
              { "type": "paragraph", "text": "Los entronques (trébol, diamante, trompeta) conectan vías con rampas curvas y cambios de velocidad. La visibilidad en rampas puede ser limitada." },
              { "type": "paragraph", "text": "Líneas discontinuas grandes suelen marcar fin de carril y salidas. Observe ‘EXIT ONLY’ y avisos de carril que termina." },
              { "type": "paragraph", "text": "Las zonas de entrelazado aparecen donde se cruzan entradas y salidas. Mire lejos, señalice y sea paciente." },
              { "type": "bulleted-list", "items": ["Lea los señalamientos con anticipación.", "Ajuste velocidad antes de la curva.", "Mantenga su carril en las rampas; evite cambios a último momento."] }
            ]
          },
          {
            "id": "U06-L11",
            "title": "Planeación de salida, fin de carril y entrelazado",
            "minutes": 4,
            "content": [
              { "type": "paragraph", "text": "Cambie al carril correcto con tiempo. Señalice por al menos cinco segundos (≈400 pies) para indicar su salida." },
              { "type": "paragraph", "text": "Respete las líneas continuas y el ‘gore’. Si se pasa, vaya a la siguiente salida; nunca retroceda." },
              { "type": "paragraph", "text": "En segmentos de entrelazado, alternen (‘zipper’) y evite acelerar para bloquear." },
              { "type": "bulleted-list", "items": ["Revise puntos ciegos antes de cambiar.", "Dé espacio adicional a camiones que salen o se incorporan."] }
            ]
          }
        ]
      },
      {
        "id": "U06-S05",
        "title": "Peligros de manejo urbano",
        "lessons": [
          {
            "id": "U06-L12",
            "title": "Intersecciones y paradas frecuentes",
            "minutes": 5,
            "content": [
              { "type": "paragraph", "text": "Las calles urbanas tienen intersecciones cercanas. Espere semáforos y tráfico de pare‑avance." },
              { "type": "paragraph", "text": "Los peatones tienen preferencia en cruces marcados y no marcados. Ceda el paso y escanee a ambos lados." },
              { "type": "paragraph", "text": "En un apagón de semáforo, trate la intersección como alto de 4 vías. No bloquee la intersección si no puede despejarla." },
              { "type": "bulleted-list", "items": ["Lleve el pie sobre el freno cerca de cruces peatonales.", "Revise izquierda‑derecha‑izquierda antes de avanzar.", "Atienda giros y ciclistas."] }
            ]
          },
          {
            "id": "U06-L13",
            "title": "Obstrucciones: doble fila, entregas y viajes compartidos",
            "minutes": 4,
            "content": [
              { "type": "paragraph", "text": "Espere paradas de reparto, autobuses y viajes por app en las guarniciones. La gente puede salir entre vehículos." },
              { "type": "paragraph", "text": "Estacionarse en doble fila es ilegal. Nunca se detenga en el carril de circulación para cargar o descargar." },
              { "type": "paragraph", "text": "Deje espacio extra al lado derecho y esté listo para frenar. Las puertas pueden abrirse de repente." },
              { "type": "bulleted-list", "items": ["Si un carril bici está bloqueado, salga con cuidado y ceda a ciclistas.", "Puede entrar al carril bici a no más de 200 pies antes de girar a la derecha; revise puntos ciegos."] }
            ]
          }
        ]
      },
      {
        "id": "U06-S06",
        "title": "Usuarios vulnerables y transporte público",
        "lessons": [
          {
            "id": "U06-L14",
            "title": "Bicicletas, motonetas y la ‘zona de la puerta’",
            "minutes": 5,
            "content": [
              { "type": "paragraph", "text": "Las bicicletas comparten la vía y pueden usar todo el carril cuando sea necesario. Démosles espacio y espere cambios de velocidad." },
              { "type": "paragraph", "text": "Deje al menos tres pies para rebasar. Cambie de carril para rebasar cuando sea necesario y seguro." },
              { "type": "paragraph", "text": "La ‘zona de la puerta’ es peligrosa. Revise espejos y sobre el hombro antes de abrir las puertas cerca del tráfico o carriles bici." },
              { "type": "bulleted-list", "items": ["Nunca se estacione en un carril bici.", "Entre al carril bici dentro de 200 pies antes de girar a la derecha y ceda a ciclistas.", "Atienda e‑scooters y ciclistas lentos cerca de guarniciones."] }
            ]
          },
          {
            "id": "U06-L15",
            "title": "Carriles ‘Solo Autobús’, tren ligero y paradas",
            "minutes": 4,
            "content": [
              { "type": "paragraph", "text": "No conduzca, se detenga ni se estacione en carriles ‘Solo Autobús’. Puede cruzarlos para girar a la derecha donde se permita." },
              { "type": "paragraph", "text": "En zonas de seguridad marcadas para tranvías/trolebuses, pase a no más de 10 mph y esté atento a peatones." },
              { "type": "paragraph", "text": "No rebase tren ligero por la izquierda salvo indicación. Mire si vienen trenes antes de cruzar vías." },
              { "type": "bulleted-list", "items": ["Ceda a autobuses que vuelven al tráfico cuando sea seguro.", "Siga las señales de tránsito para transporte y reglas locales."] }
            ]
          }
        ]
      },
      {
        "id": "U06-S07",
        "title": "Reglas de estacionamiento en ciudad",
        "lessons": [
          {
            "id": "U06-L16",
            "title": "Colores de guarnición, parquímetros y límites de tiempo",
            "minutes": 5,
            "content": [
              { "type": "paragraph", "text": "Colores: blanco = subir/bajar pasajeros, verde = tiempo limitado, amarillo = carga/comercial, rojo = prohibido parar, azul = personas discapacitadas con distintivo/placas." },
              { "type": "paragraph", "text": "Lea letreros y parquímetros para horarios y límites. Siga siempre los letreros y reglas locales." },
              { "type": "paragraph", "text": "Estaciónese a no más de 18 pulgadas de la guarnición al estacionarse en paralelo." },
              { "type": "bulleted-list", "items": ["Revise restricciones de remolque o limpia‑calles.", "En blanco pare solo el tiempo necesario; en amarillo cargue/descargue como lo permita la zona."] }
            ]
          },
          {
            "id": "U06-L17",
            "title": "Cuestas, paralelo y zonas prohibidas",
            "minutes": 4,
            "content": [
              { "type": "paragraph", "text": "En cuestas: ruedas hacia la guarnición al bajar; lejos de la guarnición al subir; sin guarnición, apunte las ruedas hacia la orilla." },
              { "type": "paragraph", "text": "Para estacionar en paralelo: alinee, retroceda a ~45°, enderece y termine a no más de 18 pulgadas de la guarnición." },
              { "type": "paragraph", "text": "No se estacione en cruces peatonales, frente a cocheras, cerca de hidrantes ni en doble fila." },
              { "type": "bulleted-list", "items": ["Azul requiere distintivo/placas.", "Rojo y zonas de autobuses prohíben detenerse."] }
            ]
          }
        ]
      },
      {
        "id": "U06-S08",
        "title": "Condiciones especiales",
        "lessons": [
          {
            "id": "U06-L18",
            "title": "Resplandor nocturno, rocío y hidroplaneo",
            "minutes": 4,
            "content": [
              { "type": "paragraph", "text": "Use luces bajas con lluvia o niebla y cuando use el limpiaparabrisas. No conduzca solo con luces de estacionamiento." },
              { "type": "paragraph", "text": "De noche, mire hacia el borde derecho para evitar el encandilamiento y reduzca para poder detenerse dentro de lo que alcanza a ver." },
              { "type": "paragraph", "text": "Con lluvia fuerte, reduzca la velocidad y evite charcos. Si empieza a hidroplanear, suelte suavemente el acelerador y evite frenar o girar bruscamente." },
              { "type": "bulleted-list", "items": ["Si no ve a 100 pies en lluvia/nieve intensa, no es seguro circular a más de ~30 mph."] }
            ]
          },
          {
            "id": "U06-L19",
            "title": "Viento, turbulencia de camiones y emergencias",
            "minutes": 4,
            "content": [
              { "type": "paragraph", "text": "Los vehículos grandes generan turbulencia y tienen puntos ciegos amplios. No circule a su lado por mucho tiempo. Rebáselos por la izquierda sin cortarlos." },
              { "type": "paragraph", "text": "Con vientos fuertes: baje la velocidad, sujete el volante con firmeza y esté atento a escombros. Evite el control de velocidad crucero." },
              { "type": "paragraph", "text": "Si su vehículo se avería, oríllese al acotamiento derecho, encienda intermitentes, llame por ayuda (511/FSP donde aplique) y permanezca dentro con el cinturón puesto." },
              { "type": "bulleted-list", "items": ["En un operativo de control de tráfico, encienda intermitentes y reduzca a la velocidad de la patrulla hasta que apaguen las luces."] }
            ]
          }
        ]
      }
    ]
  }