{
  "unit": 7,
  "j_code": "CA",
  "course_code": "DE-ONLINE",
  "lang": "en",
  "title": "Impaired, Distracted & Drowsy Driving",
  "minutes_required": 78,
  "objectives": [
    "Identify common forms of impairment (alcohol, drugs/medications, cannabis, fatigue, distractions).",
    "Explain legal consequences, including California Zero Tolerance rules for under‑21 and implied consent.",
    "Apply cell phone/texting rules and safe in‑vehicle tech habits.",
    "Recognize signs of drowsiness and choose prevention strategies.",
    "Select safe alternatives: designated driver, rideshare, delaying a trip, and family/parental agreements."
  ],
  "sections": [
    {
      "title": "Alcohol Impairment Basics",
      "lessons": [
        {
          "title": "How Alcohol Affects Driving",
          "minutes": 6,
          "content": [
            "Alcohol is a depressant. It slows your brain’s ability to notice hazards, judge speed/distance, and react in time. Even a small amount can affect safe driving.",
            "[object Object]",
            "Scenario: After a Friday home game, a friend says they’re ‘fine’ after just one drink. On the quiet drive home, a ball rolls into the street. Impaired reaction time can turn this into a crash.",
            "[object Object]"
          ],
          "review": []
        },
        {
          "title": "BAC Basics & Safe Decisions",
          "minutes": 6,
          "content": [
            "Blood Alcohol Concentration (BAC) measures alcohol in your bloodstream. California sets legal limits, but any impairment can be dangerous. ‘Under the limit’ does not equal ‘safe to drive.’",
            "[object Object]",
            "Best move: decide your ride before the event starts. Text your parent/guardian or trusted adult the plan and a backup.",
            "[object Object]"
          ],
          "review": []
        }
      ]
    },
    {
      "title": "Zero Tolerance & Implied Consent",
      "lessons": [
        {
          "title": "Under‑21: Zero Tolerance",
          "minutes": 7,
          "content": [
            "California’s Zero Tolerance law applies to drivers under 21. If an officer suspects alcohol use, screening may be required, and even very low alcohol can trigger license actions.",
            "[object Object]",
            "Consequences can include vehicle impound, fines, and license suspension/delay under current California law and DMV guidance.",
            "Bottom line: under 21 = zero alcohol while driving, and follow strict rules about transporting alcohol."
          ],
          "review": []
        },
        {
          "title": "Implied Consent & DUI Process",
          "minutes": 6,
          "content": [
            "By driving in California, you’ve agreed to chemical testing when lawfully requested (implied consent). Refusing can lead to license suspension or revocation.",
            "[object Object]",
            "If under 21, additional zero‑tolerance consequences can apply. Follow current CA law and the DMV handbook guidance."
          ],
          "review": []
        }
      ]
    },
    {
      "title": "Medications, Cannabis & Mixing Substances",
      "lessons": [
        {
          "title": "Prescription & OTC Meds",
          "minutes": 6,
          "content": [
            "Many prescription and over‑the‑counter (OTC) medications can impair alertness, vision, and reaction time. Read labels and talk to a pharmacist or doctor before driving.",
            "[object Object]",
            "If a label says ‘Do not operate a vehicle or machinery,’ don’t drive. Choose a safe alternative."
          ],
          "review": []
        },
        {
          "title": "Cannabis & Combining Substances",
          "minutes": 6,
          "content": [
            "Cannabis can distort time‑distance judgement, slow reaction, and reduce attention. Driving while impaired by cannabis is illegal.",
            "[object Object]",
            "If cannabis is present in your plans—don’t drive. Use a sober ride or wait until you are unimpaired and it is legal and safe to do so."
          ],
          "review": []
        }
      ]
    },
    {
      "title": "Phones, Texting & In‑Car Tech",
      "lessons": [
        {
          "title": "Cell Phone & Texting Rules",
          "minutes": 7,
          "content": [
            "Hand‑held phone use while driving is illegal. Adults may use hands‑free only when necessary and properly mounted. Minors may not use a phone or wireless device while driving, except for emergencies.",
            "[object Object]",
            "Safer choice: pull over to a safe, legal location to make a call or send a message."
          ],
          "review": []
        },
        {
          "title": "Infotainment & Other Distractions",
          "minutes": 6,
          "content": [
            "Navigation, playlists, and vehicle screens can pull your eyes, hands, and mind away from driving. Set up before you shift into DRIVE.",
            "[object Object]",
            "Remember: ‘Eyes off the road’ for even a few seconds at speed equals a long blind travel distance."
          ],
          "review": []
        }
      ]
    },
    {
      "title": "Drowsy Driving",
      "lessons": [
        {
          "title": "Warning Signs & Circadian Dips",
          "minutes": 6,
          "content": [
            "[object Object]",
            "Circadian ‘low’ times increase risk—late night/early morning and mid‑afternoon. Don’t rely on energy drinks; they wear off.",
            "If you feel sleepy, you’re already impaired. Stop driving."
          ],
          "review": []
        },
        {
          "title": "Prevention Strategies",
          "minutes": 6,
          "content": [
            "[object Object]",
            "If a medication makes you sleepy, don’t drive—choose a different time or a different ride."
          ],
          "review": []
        }
      ]
    },
    {
      "title": "Passengers, Food & Other Everyday Distractions",
      "lessons": [
        {
          "title": "Friends, Music & Social Pressure",
          "minutes": 6,
          "content": [
            "Passengers can be helpful spotters—or major distractions. As the driver, you set the tone.",
            "[object Object]",
            "Scenario: Your friends want a ‘story’ while you drive. You can’t film while driving. Park first or hand off the phone."
          ],
          "review": []
        },
        {
          "title": "Food, Drinks & Loose Items",
          "minutes": 5,
          "content": [
            "[object Object]",
            "Best move: eat before or after you drive, not during."
          ],
          "review": []
        }
      ]
    },
    {
      "title": "Enforcement, Penalties & Safer Alternatives",
      "lessons": [
        {
          "title": "Enforcement & Penalties (Overview)",
          "minutes": 7,
          "content": [
            "California law provides serious consequences for DUI and under‑21 violations. Administrative license actions may occur, and courts can impose additional penalties. Requirements can include DUI education programs, proof of insurance, and ignition interlock devices in some cases.",
            "[object Object]"
          ],
          "review": []
        },
        {
          "title": "Safer Alternatives & Family Agreements",
          "minutes": 7,
          "content": [
            "Plan A/B/C: (A) designated sober driver, (B) rideshare/taxi, (C) call a parent/guardian or trusted adult. No questions asked—safety first.",
            "[object Object]",
            "If a friend is impaired, take the keys and choose a sober ride. Real friends protect each other."
          ],
          "review": []
        }
      ]
    }
  ],
  "metadata": {
    "version": "1.0.0",
    "updated_at": "2025-08-20T06:02:45.967Z"
  }
}
