{
  "meta": {
    "j_code": "CA",
    "course_code": "DE-ONLINE",
    "unit_no": 1,
    "lang": "es",
    "unit_title": "Reglas de Tránsito: Señales, Semáforos y Derecho de Paso",
    "minutes_required": 60,
    "objectives": [
      "Identificar y entender las señales de tránsito, semáforos y marcas en el pavimento",
      "Aprender las reglas de derecho de paso para diferentes situaciones de tránsito",
      "Entender las leyes y regulaciones básicas de tránsito",
      "Reconocer las violaciones de tránsito comunes y sus consecuencias",
      "Desarrollar hábitos de conducción segura y habilidades de toma de decisiones",
      "Aprender cómo responder a vehículos de emergencia y autobuses escolares",
      "Entender la importancia de seguir las reglas de tránsito para la seguridad"
    ],
    "source": "Manual del Conductor de California 2024"
  },
  "sections": [
    {
      "id": "U1-S1",
      "title": "Señales de Tránsito y Sus Significados",
      "lessons": [
        {
          "id": "U1-L1",
          "title": "Señales Regulatorias",
          "paragraphs": [
            {
              "type": "p",
              "text": "Las señales regulatorias te dicen qué debes hacer o no debes hacer. Generalmente son rectangulares con letras o símbolos negros sobre fondo blanco. Estas señales son la ley y debes obedecerlas."
            },
            {
              "type": "p",
              "text": "Las señales de alto son octagonales (8 lados) y rojas con letras blancas. Cuando veas una señal de alto, debes detenerte completamente antes de la línea de alto o el cruce peatonal. Si no hay línea de alto o cruce peatonal, detente antes de entrar a la intersección."
            },
            {
              "type": "p",
              "text": "Las señales de ceder el paso son triangulares y rojas y blancas. Significan que debes reducir la velocidad y estar listo para detenerte si es necesario. Deja que otro tránsito pase primero si hay un conflicto."
            },
            {
              "type": "li",
              "text": "Las señales de límite de velocidad muestran la velocidad máxima legal para esa carretera"
            },
            {
              "type": "li",
              "text": "Las señales de no estacionar indican donde no puedes estacionar tu vehículo"
            },
            {
              "type": "li",
              "text": "Las señales de dirección única muestran la dirección en que debe fluir el tránsito"
            }
          ]
        },
        {
          "id": "U1-L2",
          "title": "Señales de Advertencia",
          "paragraphs": [
            {
              "type": "p",
              "text": "Las señales de advertencia te alertan sobre peligros potenciales adelante. Generalmente son en forma de diamante con letras o símbolos negros sobre fondo amarillo. Estas señales te ayudan a prepararte para lo que viene."
            },
            {
              "type": "p",
              "text": "Las señales de curva te advierten sobre giros cerrados adelante. La señal puede mostrar la velocidad recomendada para la curva. Reduce la velocidad antes de entrar a la curva para mantener el control de tu vehículo."
            },
            {
              "type": "p",
              "text": "Las señales de zona escolar indican que estás entrando a un área donde pueden estar presentes niños. Los límites de velocidad generalmente se reducen en las zonas escolares y debes tener mucho cuidado."
            },
            {
              "type": "li",
              "text": "Las señales de cruce peatonal advierten sobre personas cruzando la carretera"
            },
            {
              "type": "li",
              "text": "Las señales de cruce de animales indican que la vida silvestre puede estar en la carretera"
            },
            {
              "type": "li",
              "text": "Las señales de resbaladizo cuando está mojado advierten sobre tracción reducida en la lluvia"
            }
          ]
        },
        {
          "id": "U1-L3",
          "title": "Señales Informativas",
          "paragraphs": [
            {
              "type": "p",
              "text": "Las señales informativas proporcionan información sobre destinos, servicios y rutas. Te ayudan a navegar hacia donde quieres ir. Estas señales generalmente son verdes, azules o marrones."
            },
            {
              "type": "p",
              "text": "Las señales verdes proporcionan información direccional para autopistas y carreteras principales. Muestran números de ruta, destinos y distancias. Presta atención a estas señales para mantenerte en el camino correcto."
            },
            {
              "type": "p",
              "text": "Las señales azules indican servicios como gasolineras, restaurantes y hospitales. Las señales marrones apuntan a áreas recreativas como parques y sitios históricos."
            }
          ]
        }
      ]
    },
    {
      "id": "U1-S2",
      "title": "Semáforos y Luces de Tránsito",
      "lessons": [
        {
          "id": "U1-L4",
          "title": "Colores de Semáforos",
          "paragraphs": [
            {
              "type": "p",
              "text": "Los semáforos controlan el flujo de tránsito en las intersecciones. Usan tres colores: rojo, amarillo y verde. Cada color tiene un significado específico que todos los conductores deben entender y seguir."
            },
            {
              "type": "p",
              "text": "Rojo significa alto. Debes detenerte antes de la línea de alto o el cruce peatonal. Si no hay línea de alto, detente antes de entrar a la intersección. Debes permanecer detenido hasta que la luz cambie a verde."
            },
            {
              "type": "p",
              "text": "Amarillo significa precaución. La luz está a punto de cambiar a rojo. Si puedes detenerte de manera segura, debes hacerlo. Si estás demasiado cerca para detenerte de manera segura, puedes continuar a través de la intersección."
            },
            {
              "type": "p",
              "text": "Verde significa avanzar, pero solo si la intersección está despejada. Mira en ambas direcciones antes de proceder, incluso con luz verde. Otros conductores aún pueden estar en la intersección."
            }
          ]
        },
        {
          "id": "U1-L5",
          "title": "Señales de Tránsito Especiales",
          "paragraphs": [
            {
              "type": "p",
              "text": "Algunas intersecciones tienen señales especiales para peatones, bicicletas o vehículos que giran. Estas señales ayudan a manejar diferentes tipos de tránsito de manera segura."
            },
            {
              "type": "p",
              "text": "Las señales peatonales muestran una persona caminando (blanca) cuando es seguro cruzar y una mano levantada (roja) cuando los peatones no deben cruzar. Siempre cede el paso a los peatones en los cruces peatonales."
            },
            {
              "type": "p",
              "text": "Las flechas de giro permiten movimientos específicos cuando la luz principal podría estar roja. Una flecha verde significa que puedes girar en esa dirección. Una flecha roja significa que no puedes girar en esa dirección."
            },
            {
              "type": "li",
              "text": "Las luces rojas parpadeantes significan alto, luego proceder cuando sea seguro"
            },
            {
              "type": "li",
              "text": "Las luces amarillas parpadeantes significan proceder con precaución"
            }
          ]
        }
      ]
    },
    {
      "id": "U1-S3",
      "title": "Reglas de Derecho de Paso",
      "lessons": [
        {
          "id": "U1-L6",
          "title": "Derecho de Paso Básico",
          "paragraphs": [
            {
              "type": "p",
              "text": "Las reglas de derecho de paso determinan quién va primero cuando los vehículos se encuentran. Estas reglas ayudan a prevenir accidentes y mantener el tránsito fluyendo suavemente. Siempre sé cortés y paciente con otros conductores."
            },
            {
              "type": "p",
              "text": "En un alto de cuatro direcciones, el primer vehículo en llegar tiene el derecho de paso. Si dos vehículos llegan al mismo tiempo, el vehículo a la derecha va primero. Si no estás seguro, deja que el otro conductor vaya primero."
            },
            {
              "type": "p",
              "text": "En una intersección en T, los vehículos en la carretera principal tienen el derecho de paso sobre los vehículos que giran hacia la carretera principal. Siempre cede el paso al tránsito principal a menos que tengas una luz verde."
            },
            {
              "type": "li",
              "text": "Los vehículos de emergencia con luces y sirenas siempre tienen derecho de paso"
            },
            {
              "type": "li",
              "text": "Los peatones en cruces peatonales tienen derecho de paso sobre los vehículos"
            },
            {
              "type": "li",
              "text": "Los autobuses escolares con luces parpadeantes deben recibir derecho de paso"
            }
          ]
        },
        {
          "id": "U1-L7",
          "title": "Derecho de Paso en Intersecciones",
          "paragraphs": [
            {
              "type": "p",
              "text": "Las intersecciones pueden ser complejas, especialmente cuando múltiples vehículos quieren girar o ir derecho. Entender las reglas de derecho de paso ayuda a prevenir confusión y accidentes."
            },
            {
              "type": "p",
              "text": "Cuando giras a la izquierda en una intersección, debes ceder el paso al tránsito que viene de frente yendo derecho o girando a la derecha. Espera un espacio seguro antes de hacer tu giro."
            },
            {
              "type": "p",
              "text": "Cuando entras a una carretera desde un camino de entrada o estacionamiento, debes ceder el paso a todo el tránsito en la carretera principal. Mira en ambas direcciones y espera un espacio seguro antes de entrar."
            },
            {
              "type": "p",
              "text": "En las glorietas, los vehículos que ya están en el círculo tienen el derecho de paso. Entra solo cuando haya un espacio seguro. Siempre cede el paso al tránsito en la glorieta."
            }
          ]
        }
      ]
    },
    {
      "id": "U1-S4",
      "title": "Vehículos de Emergencia y Autobuses Escolares",
      "lessons": [
        {
          "id": "U1-L8",
          "title": "Procedimientos para Vehículos de Emergencia",
          "paragraphs": [
            {
              "type": "p",
              "text": "Los vehículos de emergencia incluyen carros de policía, camiones de bomberos y ambulancias. Cuando veas o escuches un vehículo de emergencia acercándose, debes ceder el derecho de paso inmediatamente."
            },
            {
              "type": "p",
              "text": "Cuando un vehículo de emergencia se acerca con luces y sirenas, oríllate al lado derecho de la carretera y detente. Si estás en una calle de una sola dirección, oríllate a cualquier lado. Permanece detenido hasta que el vehículo de emergencia pase."
            },
            {
              "type": "p",
              "text": "Nunca sigas de cerca un vehículo de emergencia o trates de pasarlo. Los vehículos de emergencia pueden detenerse repentinamente o cambiar de dirección rápidamente. Mantén una distancia segura."
            },
            {
              "type": "li",
              "text": "Si estás en una intersección cuando se acerca un vehículo de emergencia, despeja la intersección primero, luego oríllate"
            },
            {
              "type": "li",
              "text": "En las autopistas, los vehículos de emergencia pueden usar el hombro - no bloquees su camino"
            }
          ]
        },
        {
          "id": "U1-L9",
          "title": "Seguridad de Autobuses Escolares",
          "paragraphs": [
            {
              "type": "p",
              "text": "Los autobuses escolares transportan niños hacia y desde la escuela. Tienen reglas especiales para proteger la seguridad de los niños. Todos los conductores deben conocer y seguir estas reglas."
            },
            {
              "type": "p",
              "text": "Cuando un autobús escolar se detiene y muestra luces rojas parpadeantes, todo el tránsito en ambas direcciones debe detenerse. Esto se aplica en todas las carreteras excepto autopistas divididas con un medianil."
            },
            {
              "type": "p",
              "text": "Debes permanecer detenido hasta que el conductor del autobús apague las luces parpadeantes y el autobús comience a moverse nuevamente. Los niños pueden estar cruzando la carretera para subir o bajar del autobús."
            },
            {
              "type": "p",
              "text": "En autopistas divididas, solo el tránsito que va en la misma dirección que el autobús debe detenerse. El tránsito que va en dirección opuesta puede proceder con precaución."
            }
          ]
        }
      ]
    },
    {
      "id": "U1-S5",
      "title": "Límites de Velocidad y Conducción Segura",
      "lessons": [
        {
          "id": "U1-L10",
          "title": "Entendiendo los Límites de Velocidad",
          "paragraphs": [
            {
              "type": "p",
              "text": "Los límites de velocidad son velocidades máximas permitidas bajo condiciones ideales. Se establecen para asegurar la seguridad de todos los usuarios de la carretera. Nunca debes exceder el límite de velocidad publicado."
            },
            {
              "type": "p",
              "text": "Los límites de velocidad varían según el tipo de carretera y ubicación. Las áreas residenciales típicamente tienen límites de velocidad más bajos (25-35 mph) para proteger a peatones y niños. Las autopistas tienen límites más altos (55-70 mph)."
            },
            {
              "type": "p",
              "text": "Las zonas escolares tienen límites de velocidad reducidos cuando los niños están presentes. Estos límites generalmente son de 15-25 mph. Presta atención a las señales de zona escolar y luces parpadeantes."
            },
            {
              "type": "li",
              "text": "Las zonas de construcción a menudo tienen límites de velocidad reducidos"
            },
            {
              "type": "li",
              "text": "Las condiciones climáticas pueden requerir conducir por debajo del límite de velocidad"
            },
            {
              "type": "li",
              "text": "La congestión de tránsito puede requerir conducir más lento que el límite"
            }
          ]
        },
        {
          "id": "U1-L11",
          "title": "Prácticas de Conducción Segura",
          "paragraphs": [
            {
              "type": "p",
              "text": "La conducción segura involucra más que solo seguir los límites de velocidad. Requiere atención constante, buen juicio y consideración por otros usuarios de la carretera."
            },
            {
              "type": "p",
              "text": "Siempre mantén una distancia de seguimiento segura. La regla general es mantenerte al menos 3-4 segundos detrás del vehículo frente a ti. En mal tiempo, aumenta esta distancia."
            },
            {
              "type": "p",
              "text": "Usa tus señales de giro para comunicar tus intenciones a otros conductores. Señala al menos 100 pies antes de girar o cambiar de carril. Esto le da tiempo a otros conductores para reaccionar."
            },
            {
              "type": "p",
              "text": "Revisa tus espejos frecuentemente y mantente consciente de lo que está sucediendo alrededor de tu vehículo. Mira adelante por peligros potenciales y planifica tus acciones en consecuencia."
            }
          ]
        }
      ]
    },
    {
      "id": "U1-S6",
      "title": "Violaciones de Tránsito Comunes",
      "lessons": [
        {
          "id": "U1-L12",
          "title": "Violaciones en Movimiento",
          "paragraphs": [
            {
              "type": "p",
              "text": "Las violaciones en movimiento son infracciones de tránsito que ocurren mientras tu vehículo está en movimiento. Estas violaciones pueden resultar en multas, puntos en tu licencia y aumentos en las tarifas de seguro."
            },
            {
              "type": "p",
              "text": "Exceder la velocidad es una de las violaciones más comunes. Incluso ir 5 mph por encima del límite puede resultar en una multa. Mientras más rápido vayas, más alta será la multa y más puntos recibirás."
            },
            {
              "type": "p",
              "text": "Pasar semáforos rojos y señales de alto es extremadamente peligroso. Estas violaciones a menudo causan accidentes serios. Siempre detente completamente y mira en ambas direcciones antes de proceder."
            },
            {
              "type": "li",
              "text": "No ceder el derecho de paso puede resultar en accidentes y citaciones"
            },
            {
              "type": "li",
              "text": "Los cambios de carril inadecuados sin señalizar son violaciones comunes"
            },
            {
              "type": "li",
              "text": "Seguir muy de cerca (pegarse) es peligroso e ilegal"
            }
          ]
        },
        {
          "id": "U1-L13",
          "title": "Consecuencias de las Violaciones",
          "paragraphs": [
            {
              "type": "p",
              "text": "Las violaciones de tránsito tienen consecuencias serias más allá de solo multas. Pueden afectar tu historial de conducción, tarifas de seguro e incluso tu capacidad para conducir legalmente."
            },
            {
              "type": "p",
              "text": "Los puntos en tu licencia pueden acumularse y llevar a la suspensión de la licencia. En California, obtener 4 puntos en 12 meses, 6 puntos en 24 meses, o 8 puntos en 36 meses puede resultar en suspensión."
            },
            {
              "type": "p",
              "text": "Las compañías de seguro revisan tu historial de conducción y pueden aumentar tus tarifas por violaciones. Algunas violaciones pueden causar que tu seguro sea cancelado o no renovado."
            },
            {
              "type": "p",
              "text": "Las violaciones serias como DUI o conducción temeraria pueden resultar en tiempo en la cárcel, revocación de licencia y cargos criminales. Siempre conduce de manera segura y responsable."
            }
          ]
        }
      ]
    }
  ]
}
